<a href="https://colab.research.google.com/github/emelandin/pythonpro/blob/main/projeto_final.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [41]:
dfs = pd.read_html ('https://br.tradingview.com/markets/stocks-brazilia/market-movers-active/', decimal=".",thousands=",")
df = dfs[0]

In [42]:
# renomeia as colunas
df.rename (columns={'Unnamed: 0':'Nome'}, inplace=True )
df.rename (columns={'Unnamed: 1':'Preço'}, inplace=True )
df.rename (columns={'Unnamed: 2':'Var%'}, inplace=True )
df.rename (columns={'Unnamed: 3':'Oscilação'}, inplace=True )
df.rename (columns={'Unnamed: 4':'Classificação'}, inplace=True )
df.rename (columns={'Unnamed: 5':'Volume'}, inplace=True )
df.rename (columns={'Unnamed: 6':'Mercado'}, inplace=True )
df.rename (columns={'Unnamed: 7':'Lucro'}, inplace=True )
df.rename (columns={'Unnamed: 8':'EPS'}, inplace=True )
df.rename (columns={'Unnamed: 9':'Funcionarios'}, inplace=True )
df.rename (columns={'Unnamed: 10':'Setor'}, inplace=True )

#remove as colunas que nao quero utilizar
df.drop('Mercado', axis=1, inplace=True)
df.drop('Lucro', axis=1, inplace=True)
df.drop('EPS', axis=1, inplace=True)
df.drop('Funcionarios', axis=1, inplace=True)
df['Oscilação'] = df['Oscilação'].astype(float)

## Execute a conversão de dados usando ferramentas de processamento de string
df['Volume'] = list(map(lambda x: x[:-1], df['Volume'].values))
df['Var%'] = list(map(lambda x: x[:-1], df['Var%'].values))

##Converter dados em formato numérico
df['Volume'] = [float(x) for x in df['Volume'].values]
df['Var%'] = [float(x) for x in df['Var%'].values]

df['Volume'] = df['Volume']*1000000

In [43]:
print (df.head(10))

                       Nome  Preço  ...       Volume                     Setor
0  C  COGN3  COGNA ON ON NM   4.69  ...  295233000.0       Serviços Comerciais
1        CIEL3  CIELO ON NM   3.55  ...  224252000.0       Serviços Comerciais
2           OIBR3  OI ON N1   2.12  ...  173987000.0              Comunicações
3  IRBR3  IRBBRASIL REON NM   6.63  ...  156906000.0                Financeiro
4    VVAR3  VIAVAREJO ON NM  17.75  ...   82340000.0        Comercio de Varejo
5  MGLU3  MAGAZ LUIZA ON NM  23.38  ...   67110000.0        Comercio de Varejo
6     T  TOTS3  TOTVS ON NM  26.75  ...   62397000.0    Serviços de Tecnologia
7         VALE3  VALE ON NM  78.00  ...   48594000.0  Minerais não Energéticos
8       ABEV3  AMBEV S/A ON  13.98  ...   41881000.0   Consumo de Não Duráveis
9    PETR3  PETROBRAS ON N2  25.55  ...   33607000.0      Minerais Energéticos

[10 rows x 7 columns]

In [12]:
# trocando M por 000/////naofoi exec
def fix_numbers(coluna):
    
    new_column = list()
    for item in coluna:
        left_numbers = item.split('.')[0]

        data = item.split('.')[-1]
        right_numbers = data.split('M')[0].ljust(3,'0')
        right_numbers = right_numbers + '000'
        print(left_numbers + right_numbers)
        
    return new_column

In [ ]:
df['Volume_fixed'] = fix_numbers(df['Volume'])
# df['Volume'] = fix_numbers(df['Volume'])

In [21]:
df['Volume']*1000000

0     295233000.0
1     224252000.0
2     173987000.0
3     156906000.0
4      82340000.0
         ...
95      1770000.0
96      1710000.0
97      1663000.0
98      1517000.0
99      1492000.0
Name: Volume, Length: 100, dtype: float64

In [19]:
print (df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Nome           100 non-null    object
 1   Preço          100 non-null    float64
 2   Var%           100 non-null    float64
 3   Oscilação      100 non-null    float64
 4   Classificação  100 non-null    object
 5   Volume         100 non-null    float64
 6   Setor          100 non-null    object
dtypes: float64(4), object(3)
memory usage: 5.6+ KB
None

In [39]:
# nao foi 
import re
def fix_names(coluna):
    
    my_results = list()
    
    for col in coluna:
        try:
            #name = re.findall('[A-Z]{4}\d{1,2}',col)[0]
            name = re.findall('[A-Z]\d[A-Z]{2}\d',col)[0]
        except:
            name = 'NA'
        
        my_results.append(name)
        
    return my_results

In [34]:
pd.Series(fix_names(df['Nome'])).value_counts()

BBSE3    1
ALSO3    1
ETER3    1
JBSS3    1
BBDC3    1
        ..
STBP3    1
TECN3    1
QUAL3    1
ENBR3    1
COGN3    1
Length: 100, dtype: int64

In [40]:
df

                           Nome  Preço  ...       Volume                     Setor
0      C  COGN3  COGNA ON ON NM   4.69  ...  295233000.0       Serviços Comerciais
1            CIEL3  CIELO ON NM   3.55  ...  224252000.0       Serviços Comerciais
2               OIBR3  OI ON N1   2.12  ...  173987000.0              Comunicações
3      IRBR3  IRBBRASIL REON NM   6.63  ...  156906000.0                Financeiro
4        VVAR3  VIAVAREJO ON NM  17.75  ...   82340000.0        Comercio de Varejo
..                          ...    ...  ...          ...                       ...
95     C  CNTO3  CENTAURO ON NM  26.56  ...    1770000.0        Comercio de Varejo
96         T  TUPY3  TUPY ON NM  21.45  ...    1710000.0        Produção Artesanal
97       H  HBOR3  HELBOR ON NM  10.96  ...    1663000.0                Financeiro
98  P  PMAM3  PARANAPANEMAON NM  10.57  ...    1517000.0  Minerais não Energéticos
99        M  MILS3  MILLS ON NM   6.43  ...    1492000.0                Financeiro

[100 rows x 7 columns]

In [47]:
def fix_names(coluna):
    
    my_results = list()
    
    for col in coluna:
        try:
            name = re.findall('[A-Z]{4}\d{1,2}',col)[0]
        except:
            
            try:
                name = re.findall('[A-Z]\d[A-Z]{2}\d',col)[0]
            except:
                name = 'NA'
        
        my_results.append(name)
        
    return my_results

fix_names(df['Nome'])

['COGN3',
 'CIEL3',
 'OIBR3',
 'IRBR3',
 'VVAR3',
 'MGLU3',
 'TOTS3',
 'VALE3',
 'ABEV3',
 'PETR3',
 'JBSS3',
 'B3SA3',
 'MEAL3',
 'BBAS3',
 'PSSA3',
 'EMBR3',
 'CVCB3',
 'HAPV3',
 'CCRO3',
 'BRML3',
 'BBSE3',
 'BRDT3',
 'DMMO3',
 'RAIL3',
 'CYRE3',
 'UGPA3',
 'CSNA3',
 'LREN3',
 'EQTL3',
 'SUZB3',
 'WEGE3',
 'JHSF3',
 'ELET3',
 'RADL3',
 'CRFB3',
 'BBDC3',
 'TIMS3',
 'BRFS3',
 'MULT3',
 'YDUQ3',
 'NTCO3',
 'BEEF3',
 'BTOW3',
 'RENT3',
 'MRFG3',
 'GNDI3',
 'STBP3',
 'LINX3',
 'SBSP3',
 'LJQQ3',
 'CPFE3',
 'SOMA3',
 'MOVI3',
 'GFSA3',
 'ECOR3',
 'HYPE3',
 'VIVT3',
 'LCAM3',
 'MRVE3',
 'PRIO3',
 'AMAR3',
 'ETER3',
 'EZTC3',
 'BKBR3',
 'PTBL3',
 'TECN3',
 'ENBR3',
 'LIGT3',
 'EGIE3',
 'PCAR3',
 'CSAN3',
 'IGTA3',
 'NEOE3',
 'SMLS3',
 'FLRY3',
 'CSMG3',
 'HGTX3',
 'TRIS3',
 'DTEX3',
 'POSI3',
 'QUAL3',
 'ENJU3',
 'LAME3',
 'SLCE3',
 'CAML3',
 'PETZ3',
 'ENAT3',
 'ALSO3',
 'ODPV3',
 'BRPR3',
 'SMTO3',
 'GRND3',
 'EVEN3',
 'GMAT3',
 'TEND3',
 'CNTO3',
 'TUPY3',
 'HBOR3',
 'PMAM3',
 'MILS3']

In [49]:
df ['Ticker'] = fix_names(df['Nome'])

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Nome           100 non-null    object
 1   Preço          100 non-null    float64
 2   Var%           100 non-null    float64
 3   Oscilação      100 non-null    float64
 4   Classificação  100 non-null    object
 5   Volume         100 non-null    float64
 6   Setor          100 non-null    object
 7   Ticker         100 non-null    object
dtypes: float64(4), object(4)
memory usage: 6.4+ KB